# board : 引数で渡される現在の立体四目並べの盤面状態
board = [
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
    ]

#player : 自分の手番を指定 1:先手(黒)、2:後手(白)
player = 1

#last_move : 直前に配置された手番
#last_move = (None, None, None)#初手手番がない場合
last_move = (0, 0, 0)